import UIKit // библиотека UIKit

var str = "Hello, playground, vi"

// «Два вида хранилищ данных:»
var per = 6; // переменные
let const = 5; // константы
/* Для хранения значений, которые не должны и
 не будут изменяться в ходе выполнения кода */
 

// Любое хранилище имеет 3 важнейших свойства :
// 1) Имя 2) Тип данных 3) Значение
// var имяПеременной = значениеПеременной


let userName = "Dolf" // в области результатов отобразится "Dolf"
var countOfFriends = 5 // в области результатов отобразится 5
userName // в области результатов отобразится "Dolf"

var i: Int = 3 // в области результатов отобразится 8»
var a: Int = countOfFriends + 5

print(a)
print(userName)
